bluebottle/funding_stripe/tests/files/payment_webhook_pending.json

{
  "id": "py_3Q7DBVK7fTZ9PRZU0w35wGXx",
  "object": "charge",
  "livemode": true,
  "payment_intent": "pi_3Q7DBVK7fTZ9PRZU0balQen7",
  "status": "pending",
  "amount": 500,
  "amount_captured": 500,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "application_fee_amount": null,
  "balance_transaction": null,
  "billing_details": {
    "address": {
      "city": "Leiden",
      "country": "NL",
      "line1": "Hansenstraat 30",
      "line2": null,
      "postal_code": "2316BJ",
      "state": ""
    },
    "email": "nn@example.com",
    "name": "Nomen Nescio",
    "phone": null
  },
  "calculated_statement_descriptor": null,
  "captured": true,
  "created": 1728293132,
  "currency": "eur",
  "customer": null,
  "description": null,
  "destination": "acct_1Q01nr2f8JhneZbA",
  "dispute": null,
  "disputed": false,
  "failure_balance_transaction": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {
  },
  "invoice": null,
  "metadata": {
    "activity_id": "1441",
    "activity_title": "Bijenvereniging Wolvega",
    "tenant_domain": "samenvoordebuurt.nl",
    "tenant_name": "regiobank"
  },
  "on_behalf_of": null,
  "order": null,
  "outcome": {
    "network_status": "approved_by_network",
    "reason": null,
    "risk_level": "not_assessed",
    "seller_message": "Payment complete.",
    "type": "authorized"
  },
  "paid": false,
  "payment_method": "pm_1Q7DC3K7fTZ9PRZUfISHaein",
  "payment_method_details": {
    "sepa_debit": {
      "bank_code": "RABO",
      "branch_code": "",
      "country": "NL",
      "fingerprint": "nnn4vCk5v7F1TleK",
      "last4": "3926",
      "mandate": "mandate_1Q7DC4K7fTZ9PRZUxRL1DHyY"
    },
    "type": "sepa_debit"
  },
  "radar_options": {
  },
  "receipt_email": null,
  "receipt_number": null,
  "receipt_url": null,
  "refunded": false,
  "review": null,
  "shipping": null,
  "source": null,
  "source_transfer": null,
  "statement_descriptor": "Samen voor de buurt",
  "statement_descriptor_suffix": "Samen voor de buur",
  "transfer_data": {
    "amount": null,
    "destination": "acct_1Q01nr2f8JhneZbA"
  },
  "transfer_group": "group_py_3Q7DBVK7fTZ9PRZU0w35wGXx"
}

